## Hierarchical Indexing

In [95]:
import pandas as pd
import numpy as np

In [96]:
index = [('California', 2000), ('California', 2010),
('New York', 2000), ('New York', 2010),
('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
18976457, 19378102,
20851820, 25145561]

pop = pd.Series(populations, index =index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [97]:
pop[('California', 2010) : ('Texas'  , 2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [98]:
pop[[i for i in pop.index if i[1] == 2010]]   #not recomended

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

In [99]:
#better way
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [100]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [101]:
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [102]:
#The unstack() method will quickly convert a multiplyindexed Series into a conventionally indexed DataFrame
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [103]:
#stack is the opposite
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [104]:
#add column
pop_df = pd.DataFrame({'total': pop, 'under18':[9267089, 9284094,4687374, 4318033,5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [105]:
 #just for 18, proportion
f_u18 = pop_df['under18'] / pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

In [106]:
#Methods of MultiIndex Creation
df = pd.DataFrame(np.random.rand(4, 2),
                  index=[['a','a','b','b'], [1, 2, 1, 2]],
                  columns = ['data1', 'data2'])
df

        data1     data2
a 1  0.011030  0.798712
  2  0.076558  0.814212
b 1  0.446799  0.568709
  2  0.086588  0.265744

In [107]:
    data = {('California', 2000):33871648,
            ('California', 2010): 37253956,
            ('Texas', 2000): 20851820,
            ('Texas', 2010): 25145561,
            ('New York', 2000): 18976457,
            ('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [108]:
#Explicit MultiIndex constructors
pd.MultiIndex.from_arrays([['a', 'a', 'b','b'], [1, 2, 1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [109]:
pd.MultiIndex.from_tuples([('a',1), ('a',2), ('b',1), ('b',2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [110]:
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [111]:
pop.index.names = ['state', 'year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [112]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Kana', 'Meiko'], ['HR', 'Temp']],
                                     names = ['subject', 'type'])

In [113]:
# mock some data
data = np.around(np.random.randn(4, 6),1)
data[:, ::2] *= 10
data +=37

In [114]:
#create the DataFrame

health_data =pd.DataFrame(data, index = index, columns=columns)
health_data

subject      Bob        Kana       Meiko
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      50.0  37.2  31.0  36.1  38.0  36.2
     2      35.0  35.7  33.0  36.6  43.0  34.5
2014 1      53.0  37.5  25.0  36.8  54.0  38.3
     2      39.0  38.5  26.0  34.6  39.0  38.0

In [115]:
health_data['Kana']

type          HR  Temp
year visit
2013 1      31.0  36.1
     2      33.0  36.6
2014 1      25.0  36.8
     2      26.0  34.6

In [116]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [117]:
pop['Texas', 2000]

20851820

In [118]:
pop['Texas']

year
2000    20851820
2010    25145561
dtype: int64

In [119]:
pop['California' : 'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [120]:
pop.loc['California': 'Texas']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [121]:
pop[:,2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [122]:
pop[pop > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [123]:
pop[['California', 'Texas']]   #just return California and textas, not new york

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

In [124]:
health_data

subject      Bob        Kana       Meiko
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      50.0  37.2  31.0  36.1  38.0  36.2
     2      35.0  35.7  33.0  36.6  43.0  34.5
2014 1      53.0  37.5  25.0  36.8  54.0  38.3
     2      39.0  38.5  26.0  34.6  39.0  38.0

In [125]:
health_data['Meiko', 'HR']

year  visit
2013  1        38.0
      2        43.0
2014  1        54.0
      2        39.0
Name: (Meiko, HR), dtype: float64

In [126]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      50.0  37.2
     2      35.0  35.7

In [127]:
health_data.iloc[2:, 2:]

subject     Kana       Meiko
type          HR  Temp    HR  Temp
year visit
2014 1      25.0  36.8  54.0  38.3
     2      26.0  34.6  39.0  38.0

In [128]:
health_data.loc[:,('Kana', 'HR')]

year  visit
2013  1        31.0
      2        33.0
2014  1        25.0
      2        26.0
Name: (Kana, HR), dtype: float64

In [129]:
index = pd.MultiIndex.from_product([['a', 'b','c'], [1, 2,]])
data = pd.Series(np.random.rand(6), index = index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.088186
      2      0.630402
b     1      0.865468
      2      0.425818
c     1      0.337713
      2      0.717137
dtype: float64

In [130]:
data['a': 'b']

char  int
a     1      0.088186
      2      0.630402
b     1      0.865468
      2      0.425818
dtype: float64

In [131]:
pop.unstack(0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [132]:
pop.unstack(level= 0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [133]:
pop.unstack(level = 1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [134]:
#recover the original series
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [135]:
#Index setting and resetting
pop_flat = pop.reset_index(name = 'population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [136]:
#returns a multiply indexed Data Frame
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

In [137]:
health_data

subject      Bob        Kana       Meiko
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      50.0  37.2  31.0  36.1  38.0  36.2
     2      35.0  35.7  33.0  36.6  43.0  34.5
2014 1      53.0  37.5  25.0  36.8  54.0  38.3
     2      39.0  38.5  26.0  34.6  39.0  38.0

In [138]:
#Data Aggregations on Multi-Indices
data_mean = health_data.mean(level = 'year')
data_mean

subject   Bob         Kana        Meiko
type       HR   Temp    HR   Temp    HR   Temp
year
2013     42.5  36.45  32.0  36.35  40.5  35.35
2014     46.0  38.00  25.5  35.70  46.5  38.15

In [139]:
#mean of columns
data_mean.mean(axis = 1, level = 'type')

type         HR       Temp
year
2013  38.333333  36.050000
2014  39.333333  37.283333

## Combining Datasets: Concat and Append

In [26]:
import pandas as pd
import numpy as np

In [27]:
def make_df(cols, ind):
  data = {c:[str(c) + str(i) for i in ind]
          for c in cols}
  return pd.DataFrame(data, ind)

make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [9]:
#concatenation in np 
x = [1, 3, 4]
y = [5, 9, 3]
z = [2, 8, 6]

np.concatenate([x,y,z])

array([1, 3, 4, 5, 9, 3, 2, 8, 6])

In [15]:
x = [[2, 3],
     [6, 9]]
np.concatenate([x, x], axis = 1)

array([[2, 3, 2, 3],
       [6, 9, 6, 9]])

In [21]:
#Concatenation with pd.concat
be1 = pd.Series(['A','B', 'C'], index = [1, 2, 3])
be2 = pd.Series(['D', 'E', 'F'], index = [4, 5, 6,])

pd.concat([be1, be2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [30]:
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])

print(df1); print(df2); print(pd.concat([df1, df2]))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [41]:
df3 = make_df('AB', [0, 1])
df4 = make_df('CD', [0, 1])

print(df3); print(df4); print(pd.concat([df3, df4], axis = 1))

    A   B
0  A0  B0
1  A1  B1
    C   D
0  C0  D0
1  C1  D1
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

In [43]:
#Ignoring the index
print(df1); print(df2); print(pd.concat([df1, df2], ignore_index=True))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
0  A1  B1
1  A2  B2
2  A3  B3
3  A4  B4

In [47]:
#Adding MultiIndex keys.
print(df1); print(df2); print(pd.concat([df1, df2], keys= ['x', 'y']))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
      A   B
x 1  A1  B1
  2  A2  B2
y 3  A3  B3
  4  A4  B4

In [62]:
  df5 = make_df('ABC', [1, 2])
  df6 = make_df('DEF', [3, 4])

  df7 = pd.concat([df5, df6])
  df7

     A    B    C    D    E    F
1   A1   B1   C1  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN
3  NaN  NaN  NaN   D3   E3   F3
4  NaN  NaN  NaN   D4   E4   F4

In [61]:
df7.fillna(0)

    A   B   C   D   E   F
1  A1  B1  C1   0   0   0
2  A2  B2  C2   0   0   0
3   0   0   0  D3  E3  F3
4   0   0   0  D4  E4  F4

In [67]:
print(pd.concat([df5, df6], join='inner'))

Empty DataFrame
Columns: []
Index: [1, 2, 3, 4]

In [69]:
#append() method  , can be used if you want in the place of pd.concat()
df5.append(df6)

     A    B    C    D    E    F
1   A1   B1   C1  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN
3  NaN  NaN  NaN   D3   E3   F3
4  NaN  NaN  NaN   D4   E4   F4

## Combining Datasets: Merge and Join